cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"

# Custom taps
tap "camspiers/taps"
tap "koekeishiya/formulae"
tap "Rigellute/tap"
tap "Schniz/tap"
tap "rlue/utils"

# Homebrew essentials
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "calcurse"
brew "composer"
brew "coreutils"
brew "dbus"
brew "editorconfig"
brew "evince"
brew "fnm"
brew "fontconfig"
brew "fontforge"
brew "fpp"
brew "fzf"
brew "gawk"
brew "git"
brew "gitlab-gem"
brew "gnu-sed"
brew "ifstat"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mkcert"
brew "mosh"
brew "mycli"
brew "ncurses"
brew "neovim"
brew "node"
brew "php"
brew "pkg-config"
brew "portaudio"
brew "python"
brew "rbenv"
brew "readline"
brew "readydocker"
brew "ripgrep"
brew "rlue/utils/timer"
brew "ruby"
brew "skhd"
brew "spotify-tui"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "tmuxinator-fzf-start"
brew "vifm"
brew "vim"
brew "wget"
brew "yabai"
brew "yarn"

# App essentials
cask "1password"
cask "1password-cli"
cask "anki"
cask "balenaetcher"
cask "docker"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "fontforge"
cask "iina"
cask "kap"
cask "keycastr"
cask "kitty"
cask "mactex"
cask "openvpn-connect"
cask "sequel-pro-nightly"
cask "vimr"
