cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"

# Custom taps
tap "Schniz/tap"
tap "koekeishiya/formulae"
tap "camspiers/taps"

# Homebrew essentials
brew "bash"
brew "bash-completion"
brew "composer"
brew "coreutils"
brew "editorconfig"
brew "fnm"
brew "fontconfig"
brew "fontforge"
brew "fpp"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "ifstat"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mkcert"
brew "mosh"
brew "ncurses"
brew "neovim"
brew "node"
brew "php"
brew "python"
brew "ranger"
brew "readline"
brew "readydocker"
brew "ripgrep"
brew "ruby"
brew "skhd"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "tmuxinator-fzf-start"
brew "wget"
brew "yabai"
brew "yarn"

# App essentials
cask "docker"
cask "fontforge"
cask "keycastr"
cask "kitty"
cask "sequel-pro"
cask "ubersicht"
