cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"

# Custom taps
tap "camspiers/taps"
tap "koekeishiya/formulae"
tap "Rigellute/tap"
tap "Schniz/tap"
tap "rlue/utils"
tap "cmacrae/formulae"

# Homebrew essentials
brew "luarocks"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "composer"
brew "coreutils"
brew "editorconfig"
brew "fnm"
brew "fontconfig"
brew "fontforge"
brew "fpp"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "ifstat"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mkcert"
brew "mosh"
brew "mycli"
brew "ncurses"
brew "neovim"
brew "node"
brew "pandoc"
brew "pkg-config"
brew "python"
brew "rbenv"
brew "readline"
brew "readydocker"
brew "ripgrep"
brew "rlue/utils/timer"
brew "rbenv"
brew "skhd"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator-fzf-start"
brew "vim"
brew "wget"
brew "yabai"
brew "cmacrae/formulae/spacebar"
brew "yarn"
brew "cmake"
brew "fennel"

# App essentials
cask "anki"
cask "font-hasklug-nerd-font"
cask "fontforge"
cask "iina"
cask "kap"
cask "keycastr"
cask "kitty"
cask "vimr"
cask "dotnet"
